Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: བསྐལ་པ་བརྒྱའམ། བསྐལ་པ་སྟོང་ངམ། བསྐལ་པ་བྱེ་བའམ། བསྐལ་པ་བྱེ་བ་ཕྲག་འབུམ་མམ། བསྐལ་པ་ཁྲག་ཁྲིག་གམ། བསྐལ་པ་གཏམས་སམ། བསྐལ་པ་དཀྲིགས་སམ། བསྐལ་པ་ཁྱད་ཕྱིན་ནསབསྐལ་པ་དཔག་ཏུ་མེད་པར་ལན་གསུང་བ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ་
en: He can respond for a hundred eons, or a thousand eons, or ten million eons, or a billion eons, or a trillion eons, or a quadrillion eons, or a quintillion eons, or a sextillion eons, or an immeasurable number of eons . . . up until . . . .

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་མི་ཤེས་པ་ཀུན་ཤེས་པར་བྱེད་པའི་དབང་པོ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the faculty that facilitates understanding of all that has not been understood.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: Householder, the Thus-Gone One correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing what is possible.’

source: གནས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands, ‘I know everything that has otherwise not been understood with regard to the knowledge of the origin as related to knowledge of the possible.’

source: གནས་ཤེས་པ་འགོག་པ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands, ‘I know everything that has otherwise not been understood with regard to the knowledge of cessation as related to knowledge of the possible.’

source: གནས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands, ‘I know everything that has otherwise not been understood with regard to the knowledge of the path that leads to cessation as related to knowledge of the possible.’

source: གནས་མ་ཡིན་པ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: “Householder, the Thus-Gone One correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing what is impossible.’

source: གནས་མ་ཡིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands, ‘I know everything that has otherwise not been understood with regard to the knowledge of the origin as related to knowledge of the impossible.’

source: གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands, ‘I know everything that has otherwise not been understood with regard to the knowledge of cessation as related to knowledge of the impossible.’

source: གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands, ‘I know everything that has otherwise not been understood with regard to the knowledge of the path that leads to cessation as related to knowledge of the impossible.’

source: འདས་པ་ཤེས་ཏེ་འདས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་འདས་པ་ཤེས་པ་འགོག་པ་ཤེས། འདས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the past, the knowledge of the origin as related to knowledge of the past, the knowledge of cessation as related to knowledge of the past, and the knowledge of the path that leads to cessation as related to knowledge of the past.’

source: མ་འོངས་པ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ། མ་འོངས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། མ་འོངས་པ་ཤེས་པ་འགོག་པ་ཤེས། མ་འོངས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the future, the knowledge of the origin as related to knowledge of the future, the knowledge of cessation as related to knowledge of the future, and the knowledge of the path that leads to cessation as related to knowledge of the future.’

source: ད་ལྟར་བྱུང་བ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ། ད་ལྟར་བྱུང་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། ད་ལྟར་བྱུང་བ་ཤེས་པ་འགོག་པ་ཤེས། ད་ལྟར་བྱུང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the present, the knowledge of the origin as related to knowledge of the present, the knowledge of cessation as related to knowledge of the present, and the knowledge of the path that leads to cessation as related to knowledge of the present.’

source: ལས་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ། ལས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་དང་ལས་ཤེས་པ་འགོག་པ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་དང་། ལས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing karma, the knowledge of the origin as related to knowledge of karma, the knowledge of cessation as related to knowledge of karma, and the knowledge of the path that leads to cessation as related to knowledge of karma.’

source: ཡང་དག་པར་བླང་བ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ། ཡང་དག་པར་བླང་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། ཡང་དག་པར་བླང་བ་ཤེས་པ་འགོག་པ་ཤེས། ཡང་དག་པར་བླང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing adopted actions, the knowledge of the origin as related to knowledge of adopted actions, the knowledge of cessation as related to knowledge of adopted actions, and the knowledge of the path that leads to cessation as related to knowledge of adopted actions.’

source: གནས་དང་གནས་ཀྱི་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ། གནས་དང་གནས་ཀྱི་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། གནས་དང་གནས་ཀྱི་ཤེས་པ་འགོག་པ་ཤེས། གནས་དང་གནས་ཀྱི་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the contemplations of abodes, the knowledge of the origin as related to knowledge of the contemplations of abodes, the knowledge of cessation as related to knowledge of the contemplations of abodes, and the knowledge of the path that leads to cessation as related to knowledge of the contemplations of abodes.’

source: རྒྱུ་དང་རྒྱུའི་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ། ཀུན་འབྱུང་བ་དང་། འགོག་པ་དང་། འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the contemplations of causes.’ He correctly understands, ‘I know everything that has otherwise not been understood with regard to the knowledge of the origin , the knowledge of cessation, and the knowledge of the path that leads to cessation as related to knowledge of the contemplations of causes.’

source: རྣམ་པར་སྨིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། རྣམ་པར་སྨིན་པ་ཤེས་པ་འགོག་པ་ཤེས། རྣམ་པར་སྨིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything [that has otherwise not been understood] with regard to knowing ripening, the knowledge of the origin as related to knowledge of ripening, the knowledge of cessation as related to knowledge of ripening, and the knowledge of the path that leads to cessation as related to knowledge of ripening.’

source: ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་འགོག་པ་ཤེས། ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the paths that lead to all destinations, the knowledge of the origin as related to knowledge of the paths that lead to all destinations, the knowledge of cessation as related to knowledge of the paths that lead to all destinations, and the knowledge of the path that leads to cessation as related to knowledge of the paths that lead to all destinations.’

source: ཁམས་དུ་མ་ཤེས་ཏེ། ཁམས་དུ་མ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། ཁམས་དུ་མ་ཤེས་པ་འགོག་པ་ཤེས། ཁམས་དུ་མ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the several elements, the knowledge of the origin as related to knowledge of the several elements, the knowledge of cessation as related to knowledge of the several elements, and the knowledge of the path that leads to cessation as related to knowledge of the several elements.’

source: ཁམས་སྣ་ཚོགས་ཤེས་ཏེ། ཁམས་སྣ་ཚོགས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། ཁམས་སྣ་ཚོགས་ཤེས་པ་འགོག་པ་ཤེས། ཁམས་སྣ་ཚོགས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the various elements, the knowledge of the origin as related to knowledge of the various elements, the knowledge of cessation as related to knowledge of the various elements, and the knowledge of the path that leads to cessation as related to knowledge of the various elements.’

source: འཇིག་རྟེན་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ། འཇིག་རྟེན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། འཇིག་རྟེན་ཤེས་པ་འགོག་པ་ཤེས། འཇིག་རྟེན་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the world.’ He correctly understands, ‘I know everything that has otherwise not been understood with regard to the knowledge of the origin as related to knowledge of the world, the knowledge of cessation as related to knowledge of the world, and the knowledge of the path that leads to cessation as related to knowledge of the world.’

source: མོས་པ་དུ་མ་ཤེས་པ་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands, ‘I know everything with regard to knowing several inclinations.’

source: མོས་པ་དུ་མ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། མོས་པ་དུ་མ་ཤེས་པ་འགོག་པ་ཤེས། མོས་པ་དུ་མ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands, ‘I know everything with regard to the knowledge of the origin as related to knowledge of several inclinations, the knowledge of cessation as related to knowledge of several inclinations, and the knowledge of the path that leads to cessation as related to knowledge of several inclinations.’

source: མོས་པ་སྣ་ཚོགས་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing various inclinations.’

source: མོས་པ་སྣ་ཚོགས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། མོས་པ་སྣ་ཚོགས་ཤེས་པ་འགོག་པ་ཤེས། མོས་པ་སྣ་ཚོགས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands, ‘I know everything with regard to the knowledge of the origin as related to knowledge of various inclinations, the knowledge of cessation as related to knowledge of various inclinations, and the knowledge of the path that leads to cessation as related to knowledge of various inclinations.’

source: དབང་པོ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་ཏེ། དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས། དབང་པོ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the faculties, the knowledge of the origin as related to knowledge of the faculties, the knowledge of cessation as related to knowledge of the faculties, and the knowledge of the path that leads to cessation as related to knowledge of the faculties.’

source: སྟོབས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། སྟོབས་ཤེས་པ་འགོག་པ་ཤེས། སྟོབས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the powers, the knowledge of the origin as related to knowledge of the powers, the knowledge of cessation as related to knowledge of the powers, and the knowledge of the path that leads to cessation as related to knowledge of the powers.’

source: བརྩོན་འགྲུས་ཤེས་ཏེ། བརྩོན་འགྲུས་ཤེས་པ་ཀུན་འབྱུང་བཤེས། བརྩོན་འགྲུས་ཤེས་པ་འགོག་པ་ཤེས། བརྩོན་འགྲུས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing diligence, the knowledge of the origin as related to knowledge of diligence, the knowledge of cessation as related to knowledge of diligence, and the knowledge of the path that leads to cessation as related to knowledge of diligence.’

source: རིམ་པ་ཤེས་ཏེ། རིམ་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། རིམ་པ་ཤེས་པ་འགོག་པ་ཤེས། རིམ་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the levels, the knowledge of the origin as related to knowledge of the levels, the knowledge of cessation as related to knowledge of the levels, and the knowledge of the path that leads to cessation as related to knowledge of the levels.’

source: བསམ་གཏན་ཤེས་ཏེ། བསམ་གཏན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། བསམ་གཏན་ཤེས་པ་འགོག་པ་ཤེས། བསམ་གཏན་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing concentration, the knowledge of the origin as related to knowledge of concentration, the knowledge of cessation as related to knowledge of concentration, and the knowledge of the path that leads to cessation as related to knowledge of concentration.’

source: རྣམ་པར་ཐར་པ་ཤེས་ཏེ། རྣམ་པར་ཐར་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། རྣམ་པར་ཐར་བ་ཤེས་པ་འགོག་པ་ཤེས། རྣམ་པར་ཐར་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ། །ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing liberation, the knowledge of the origin as related to knowledge of liberation, the knowledge of cessation as related to knowledge of liberation, and the knowledge of the path that leads to cessation as related to knowledge of liberation.’

source: ཏིང་ངེ་འཛིན་ཤེས་ཏེ། ཏིང་ངེ་འཛིན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། ཏིང་ངེ་འཛིན་ཤེས་པ་འགོག་པ་ཤེས། ཏིང་ངེ་འཛིན་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing absorption, the knowledge of the origin as related to knowledge of absorption, the knowledge of cessation as related to knowledge of absorption, and the knowledge of the path that leads to cessation as related to knowledge of absorption.’

source: སྙོམས་པར་འཇུག་པ་ཤེས་ཏེ། སྙོམས་པར་འཇུག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། སྙོམས་པར་འཇུག་པ་ཤེས་པ་འགོག་པ་ཤེས། སྙོམས་པར་འཇུག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing equilibrium, the knowledge of the origin as related to knowledge of equilibrium, the knowledge of cessation as related to knowledge of equilibrium, and the knowledge of the path that leads to cessation as related to knowledge of equilibrium.’

source: ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་ཏེ། ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་འགོག་པ་ཤེས། ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ།
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing affliction, the knowledge of the origin as related to knowledge of affliction, the knowledge of cessation as related to knowledge of affliction, and the knowledge of the path that leads to cessation as related to knowledge of affliction.’

source: རྣམ་པར་བྱང་བ་ཤེས་ཏེ། རྣམ་པར་བྱང་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། རྣམ་པར་བྱང་བ་ཤེས་པ་འགོག་པ་ཤེས། རྣམ་པར་བྱང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing purification, the knowledge of the origin as related to knowledge of purification, the knowledge of cessation as related to knowledge of purification, and the knowledge of the path that leads to cessation as related to knowledge of purification.’

source: རྣམ་པར་གཞག་པ་ཤེས་ཏེ། རྣམ་པར་གཞག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། རྣམ་པར་གཞག་པ་ཤེས་པ་འགོག་པ་ཤེས། རྣམ་པར་གཞག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing abiding, the knowledge of the origin as related to knowledge of abiding, the knowledge of cessation as related to knowledge of abiding, and the knowledge of the path that leads to cessation as related to knowledge of abiding.’

source: སྔོན་གྱི་མཐའ་ཤེས་ཏེ། སྔོན་གྱི་མཐའ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། སྔོན་གྱི་མཐའ་ཤེས་པ་འགོག་པ་ཤེས། སྔོན་གྱི་མཐའ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the past, the knowledge of the origin as related to knowledge of the past, the knowledge of cessation as related to knowledge of the past, and the knowledge of the path that leads to cessation as related to knowledge of the past.’

source: སྔོན་གྱི་གནས་ཤེས་ཏེ། སྔོན་གྱི་གནས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། སྔོན་གྱི་གནས་ཤེས་པ་འགོག་པ་ཤེས། སྔོན་གྱི་གནས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing past existences, the knowledge of the origin as related to knowledge of past existences, the knowledge of cessation as related to knowledge of past existences, and the knowledge of the path that leads to cessation as related to knowledge of past existences.’

source: ཕྱི་མའི་མཐའ་ཤེས་ཏེ། ཕྱི་མའི་མཐའ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། ཕྱི་མའི་མཐའ་ཤེས་པ་འགོག་པ་ཤེས། ཕྱི་མའི་མཐའ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the future, the knowledge of the origin as related to knowledge of the future, the knowledge of cessation as related to knowledge of the future, and the knowledge of the path that leads to cessation as related to knowledge of the future.’

source: འཆི་བ་ཤེས་ཏེ། འཆི་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། འཆི་བ་ཤེས་པ་འགོག་པ་ཤེས། འཆི་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing death, the knowledge of the origin as related to knowledge of death, the knowledge of cessation as related to knowledge of death, and the knowledge of the path that leads to cessation as related to knowledge of death.’

source: སྐྱེ་བ་ཤེས་ཏེ། སྐྱེ་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། སྐྱེ་བ་ཤེས་པ་འགོག་པ་ཤེས། སྐྱེ་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing birth, the knowledge of the origin as related to knowledge of birth, the knowledge of cessation as related to knowledge of birth, and the knowledge of the path that leads to cessation as related to knowledge of birth.’

source: འདོད་པའི་ཟག་པ་ཤེས་ཏེ། འདོད་པའི་ཟག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། འདོད་པའི་ཟག་པ་ཤེས་པ་འགོག་པ་ཤེས། འདོད་པའི་ཟག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the defilement of desire, the knowledge of the origin as related to knowledge of the defilement of desire, the knowledge of cessation as related to knowledge of the defilement of desire, and the knowledge of the path that leads to cessation as related to knowledge of the defilement of desire.’

source: སྲིད་པའི་ཟག་པ་ཤེས་ཏེ། སྲིད་པའི་ཟག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། སྲིད་པའི་ཟག་པ་ཤེས་པ་འགོག་པ་ཤེས། སྲིད་པའི་ཟག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the defilement of existence, the knowledge of the origin as related to knowledge of the defilement of existence, the knowledge of cessation as related to knowledge of the defilement of existence, and the knowledge of the path that leads to cessation as related to knowledge of the defilement of existence.’

source: ལྟ་བའི་ཟག་པ་ཤེས་ཏེ་ལྟ་བའི་ཟག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། ལྟ་བའི་ཟག་པ་ཤེས་པ་འགོག་པ་ཤེས། ལྟ་བའི་ཟག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the defilement of views, the knowledge of the origin as related to knowledge of the defilement of views, the knowledge of cessation as related to knowledge of the defilement of views, and the knowledge of the path that leads to cessation as related to knowledge of the defilement of views.’

source: མ་རིག་པའི་ཟག་པ་ཤེས་ཏེ། མ་རིག་པའི་ཟག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། མ་རིག་པའི་ཟག་པ་ཤེས་པ་འགོག་པ་ཤེས། མ་རིག་པའི་ཟག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing the defilement of ignorance, the knowledge of the origin as related to knowledge of the defilement of ignorance, the knowledge of cessation as related to knowledge of the defilement of ignorance, and the knowledge of the path that leads to cessation as related to knowledge of the defilement of ignorance.’

source: ཟད་པ་ཤེས་ཏེ། ཟད་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། ཟད་པ་ཤེས་པ་འགོག་པ་ཤེས། ཟད་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་མི་ཤེས་པ་དག་ཀུན་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He correctly understands, ‘I know everything that has otherwise not been understood with regard to knowing exhaustion, the knowledge of the origin as related to knowledge of exhaustion, the knowledge of cessation as related to knowledge of exhaustion, and the knowledge of the path that leads to cessation as related to knowledge of exhaustion.’
